Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/the_taoiseach.html.txt.tmx
Source language: en
Languages: ga

source: The Taoiseach is the head of the Government
ga: Tá an Taoiseach i gceannas ar an Rialtas

source: He or she is nominated by the Dáil (one of the Irish houses of Parliament) and is appointed by the President
ga: Ainmníonn an Dáil í nó é agus déanann an tUachtarán Taoiseach dí nó de

source: The Taoiseach then nominates the other members of the Government
ga: Ainmníonn an Taoiseach, ansin, baill eile den Rialtas

source: They are approved by the Dáil and appointed by the President
ga: Faigheann siad seo tacaíocht na Dála agus glacann an tUachtarán leis an gceapáchán

source: He may dismiss them if there is sufficient reason to do so
ga: Is féidir leis nó léi iad a chuir as a bpost má tá cúis aige nó aici sin a dhéanamh

source: You can read this information on the current Taoiseach
ga: Ta eolas ar an Taoiseach láithreach anseo

source: The Taoiseach acts as a channel of communication between the Government and the President
ga: Bíonn an Taoiseach idir an tUachtarán agus an Rialtas i gcúrsaí cumarsáide

source: He or she advises the President about summoning and dissolving the Dáil
ga: Cuireann sé nó sí comhairle ar an Uachtarán maidir leis an Dáil a lánscoir nó glaoch ar an Dáil

source: He or she presents Bills (or proposals for legislation) to the President for signature so that they can become Acts with legal effect
ga: Cuireann sé nó sí Billí ós comhair an Uachtaráin le bheith sínithe ionas go ndéantar Acht díobh agus gur féidir iad a chur i bhfeidhm

source: The Taoiseach also keeps the President generally informed on domestic and international policy matters
ga: Coiméadann an Taoiseach an tUachtarán ar an eolas faoi pholasaithe náisiúnta agus idirnáisiúnta an Rialtais

source: As the leading public figure in the Government, the Taoiseach also acts as a spokesperson for the Government on major policy issues and chairs Cabinet meetings
ga: Labhraíonn an Taoiseach thar cheann an Rialtais ar aon ní a bhaineann le polasaí. Déanann an Taoiseach cathaoirleacht ar chruinnithe Comh-Aireachta

source: He or she takes an interest in the affairs of all the Departments of State and ensures that the plans of departments are co-ordinated
ga: Bíonn súil á choiméad aige nó aici ar gach Roinn Stáit agus déanann cinnte de go bhfuil na Ranna éagsúla ar chomh intinn maidir le pléanáil de

source: He or she makes sure that Cabinet decisions are carried out by the ministers and that the ministers fully understand the implications of different Government policies
ga: Cinntíonn sé nó sí go gcuireann na hAirí i bhfeidhm na cinnithe atá tógtha ag an gComh-Aireacht agus go dtuigeann siad na himpleachtaí a bhaineann le polasaithe an Rialtais

source: The Taoiseach also has a major role to play in our relations with foreign countries
ga: Tá plé mhór ag an Taoiseach, freisin, lenar dteangbháil le tíortha eile

source: He or she represents Ireland abroad and regularly meets with the other heads of state of the European Union to help shape European policy
ga: Déanann sé nó sí ionadaíocht dúinn thar lear agus bualann go rialta le ceannairí na dtíortha eile san Aontas Eorpach chun polasaithe na hEorpa a phlé

source: The Taoiseach and all the ministers collectively are answerable to Dáil Eireann
ga: Tá an Taoiseach agus na hAirí go léir freagrach do Dháil Éireann

source: The Taoiseach is assisted in his or her duties by the Government Chief Whip
ga: Tugann an Priomhaoire Rialtais cúnamh don Taoiseach ina chuid nó ina cuid dualgas
